# AlternateUnits Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..AlternateUnits Property
GroupTypeId Class See Also
---
Alternate Units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId AlternateUnits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlternateUnits As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlternateUnits {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace